import 'package:flutter/material.dart';

class SettingMenu extends StatefulWidget {
  const SettingMenu({super.key});

  @override
  State<SettingMenu> createState() => _SettingMenuState();
}

class _SettingMenuState extends State<SettingMenu> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: Center(
          child: SingleChildScrollView(
            child: Column(
              children: [
                Container(
                  decoration: BoxDecoration(
                      border: Border.all(width: 1.0, color: Colors.grey)),
                  child: Text(
                      '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                ),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데'),
                Text(
                    '환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데환경설정을 넣을 메뉴인데')
              ],
            ),
          ),
        ),
      ),
    );
  }
}
